'''НT7.7.   7. Напишіть функцію, яка приймає 2 списки. Результатом має
 бути новий список, в якому знаходяться елементи першого списку, яких
  немає в другому. Порядок елементів, що залишилися має відповідати порядку
  в першому (оригінальному) списку. Реалізуйте обчислення за допомогою генератора
   в один рядок.
    Приклад:
    array_diff([1, 2], [1]) --> [2]
    array_diff([1, 2, 2, 2, 3, 4], [2]) --> [1, 3, 4]'''


def my_range(list_1, list_2):

    
    result = [x for x in range(100) if x - 10 + x / 10 == 10]
    return(min(words))


print(count_string('kjhsajkhgd agjhjfd afjhdg'))
